class HandBook
  class << self
    def jap_digits
      hash ||= { 1 => '一', 2 => '二',
                 3 => '三', 4 => '四',
                 5 => '五', 6 => '六',
                 7 => '七', 8 => '八',
                 9 => '九', 10 => '十',
                 20 => '二十', 30 => '三十',
                 40 => '四十', 50 => '五十',
                 1000 => '千', 100 => '百'
               }
    end

    def jap_words
      hash ||= { day: '日', month: '月',
                 year: '年', hour: '時',
                 minute: '分'
               }
    end

    def regular_digits_hiragana
      hash ||= {   '一': 'いち', '二': 'に',
                   '三': 'さん', '四': 'し',
                   '五': 'ご', '六': 'ろく',
                   '七': 'しち', '八': 'はち',
                   '九': 'く', '十': 'じゅ'
       }
    end

    def special_readings
      {
        '千': { '一': 'せん', '二': 'にせん', '三': 'さんぜん', '四': 'よんせん', '五': 'ごせん',
               '六': 'ろくせん', '七': 'ななせん', '八': 'はっせん', '九': 'きゅせん',
               '千': 'せん' },
        '百': { '一': 'ひゃく', '二': 'にひゃく', '三': 'さんびゃく', '四': 'よんひゃく', '五': 'ごひゃく',
               '六': 'ろっぴゃく', '七': 'ななひゃく', '八': 'はっぴゃく', '九': 'きゅひゃく',
               '百': 'ひゃく' },
        '日': { '一': 'ついたち', '二': 'ふつか', '三': 'みっか', '四': 'よっか', '五': 'いつか',
               '六': 'むいか', '七': 'なのか', '八': 'ようか', '九': 'ここのか', '十': 'とうか',
               '十四': 'じゅよっか', '二十四': 'じゅよっか', '二十': 'はつか' },
        '時': { '四': 'よじ' },
        '分': {}
      }
    end

    def regular_readings
      {
        '年': 'ねん',
        '月': 'がつ',
        '時': 'じ',
        '一': 'いち', '二': 'に',
        '三': 'さん', '四': 'し',
        '五': 'ご', '六': 'ろく',
        '七': 'しち', '八': 'はち',
        '九': 'く', '十': 'じゅ'
      }
    end
  end
end

# "十一時四十五分二千十六年九日二月".scan(/([^時]*時)([^分]*分)([^年]*年)([^日]*日)([^月]*月)/)
